tests/performance/submission_baseline.yml
config:
  target: "http://localhost:3001/api"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 10
      rampTo: 30
      name: Ramp up load
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health Check"
    flow:
      - get:
          url: "/submissions/health"