tests/performance/submission_load_test.yml
config:
  target: 'http://localhost/api'
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: Heavy load test
  defaults:
    headers:
      Content-Type: 'application/json'
      Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWQiOiI3N2NkNzk4MC03ZTE1LTQ3ZTAtODAyMi04ZjIxZDM2NDliNWQiLCJlbWFpbCI6ImhpZXVuZ2hpYTQ4NEBnbWFpbC5jb20iLCJyb2xlIjoidGVhY2hlciIsInR5cGUiOiJhY2Nlc3MiLCJpYXQiOjE3NzI5NzAyODAsImV4cCI6MTc3Mjk3MTE4MH0.JR1a-Ev2kuopEENke_lUTntdWIJlmiTa_G_kcoTRUro'

scenarios:
  - name: 'Submit Two Sum Solution'
    flow:
      - post:
          url: '/submissions'
          json:
            problemId: '0f465ec8-b3a7-402e-8d5a-a7e99a2f37cb'
            language: 'cpp'
            sourceCode: "#include <iostream>\n#include <vector>\n#include <unordered_map>\nusing namespace std;\n\nvector<int> twoSum(vector<int>& nums, int target) {\n    unordered_map<int, int> seen;\n    for (int i = 0; i < nums.size(); i++) {\n        int complement = target - nums[i];\n        if (seen.count(complement)) {\n            return {seen[complement], i};\n        }\n        seen[nums[i]] = i;\n    }\n    return {};\n}\n\nint main() {\n    int n;\n    cin >> n;\n    vector<int> nums(n);\n    for (int i = 0; i < n; i++) {\n        cin >> nums[i];\n    }\n\n    int target;\n    cin >> target;\n\n    vector<int> result = twoSum(nums, target);\n    cout << \"[\" << result[0] << \",\" << result[1] << \"]\" << endl;\n\n    return 0;\n}\n"
          capture:
            - json: '$.submissionId'
              as: 'submissionId'
      - think: 2
      - get:
          url: '/submissions/{{ submissionId }}'